JJF-1/esp32_nat_router_extended/components/cmd_system/cmd_system.c
/* Console example — various system commands

   This example code is in the Public Domain (or CC0 licensed, at your option.)

   Unless required by applicable law or agreed to in writing, this
   software is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
   CONDITIONS OF ANY KIND, either express or implied.
*/

#include <stdio.h>
#include <string.h>
#include <ctype.h>
#include "esp_log.h"
#include "esp_console.h"
#include "esp_system.h"
#include "esp_sleep.h"
#include "spi_flash_mmap.h"
#include "driver/rtc_io.h"
#include "driver/uart.h"
#include "argtable3/argtable3.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "cmd_system.h"
#include "sdkconfig.h"
#include "esp_chip_info.h"
#include "esp_flash.h"
#include "soc/soc_caps.h"
#include "esp_app_desc.h"

#include "esp_timer.h"
#include <time.h>
#include <sys/time.h>

#ifdef CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS
#define WITH_TASKS_INFO 1
#endif

static const char *TAG = "cmd_system";
const char *GLOBAL_HASH = "96ad523";

static void register_free(void);
static void register_heap(void);
static void register_version(void);
static void register_restart(void);
static void register_deep_sleep(void);
static void register_light_sleep(void);

static void register_uptime(void);
static void register_time(void);

#if WITH_TASKS_INFO
static void register_tasks(void);
#endif

void register_system(void)
{
    register_free();
    register_heap();
    register_version();
    register_restart();
    register_deep_sleep();
    register_light_sleep();

    register_uptime();
    register_time();

#if WITH_TASKS_INFO
    register_tasks();
#endif
}
const char *get_project_version()
{
    const esp_app_desc_t *app_desc = esp_app_get_description();
    return app_desc->version;
}

const char *get_project_build_date()
{
    const esp_app_desc_t *app_desc = esp_app_get_description();
    return app_desc->date;
}

/* 'version' command */
static int get_version(int argc, char **argv)
{

    char chip_type[30];
    determineChipType(chip_type);
    esp_chip_info_t info;
    esp_chip_info(&info);
    uint32_t size_flash_chip;
    esp_flash_get_size(NULL, &size_flash_chip);
    const esp_app_desc_t *app_desc = esp_app_get_description();

    printf("App name:\t%s\r\n", app_desc->project_name);
    printf("App version:\t%s-%s\r\n", app_desc->version, GLOBAL_HASH);
    printf("IDF version:\t%s\r\n", app_desc->idf_ver);
    printf("Build date:\t%s %s\r\n", app_desc->date, app_desc->time);
    printf("Chip info:\r\n");
    printf("\t\tmodel: %s\r\n", chip_type);
    printf("\t\tcores: %d\r\n", info.cores);
    printf("\t\tfeature: %s%s%s%s%ld%s\r\n",
           info.features & CHIP_FEATURE_WIFI_BGN ? "/802.11bgn" : "",
           info.features & CHIP_FEATURE_BLE ? "/BLE" : "",
           info.features & CHIP_FEATURE_BT ? "/BT" : "",
           info.features & CHIP_FEATURE_EMB_FLASH ? "/Embedded-Flash: " : "/External-Flash: ",
           size_flash_chip / (1024 * 1024), " MB");
    printf("\t\trevision number: %d\r\n", info.revision);
    return 0;
}

static void register_version(void)
{
    const esp_console_cmd_t cmd = {
        .command = "version",
        .help = "Get version of chip and SDK",
        .hint = NULL,
        .func = &get_version,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
}

/** 'restart' command restarts the program */

static int restart(int argc, char **argv)
{
    ESP_LOGI(TAG, "Restarting");
    esp_restart();
}

static void register_restart(void)
{
    const esp_console_cmd_t cmd = {
        .command = "restart",
        .help = "Software reset of the chip",
        .hint = NULL,
        .func = &restart,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
}

/** 'free' command prints available heap memory */

static int free_mem(int argc, char **argv)
{
    printf("%ld\n", esp_get_free_heap_size());
    return 0;
}

static void register_free(void)
{
    const esp_console_cmd_t cmd = {
        .command = "free",
        .help = "Get the current size of free heap memory",
        .hint = NULL,
        .func = &free_mem,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
}

/* 'heap' command prints minimum heap size */
static int heap_size(int argc, char **argv)
{
    uint32_t heap_size = heap_caps_get_minimum_free_size(MALLOC_CAP_DEFAULT);
    ESP_LOGI(TAG, "min heap size: %lu", heap_size);
    return 0;
}

static void register_heap(void)
{
    const esp_console_cmd_t heap_cmd = {
        .command = "heap",
        .help = "Get minimum size of free heap memory that was available during program execution",
        .hint = NULL,
        .func = &heap_size,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&heap_cmd));
}

/** 'uptime' command prints system uptime */
static int uptime_func(int argc, char **argv)
{
    if (argc > 1) {
        printf("Usage: uptime\n");
        return 1;
    }
    int64_t uptime_us = esp_timer_get_time();
    int64_t uptime_s = uptime_us / 1000000;
    int days = uptime_s / 86400;
    int hours = (uptime_s % 86400) / 3600;
    int minutes = (uptime_s % 3600) / 60;
    int seconds = uptime_s % 60;
    printf("Uptime: %d days, %02d:%02d:%02d\n", days, hours, minutes, seconds);
    return 0;
}

static void register_uptime(void)
{
    const esp_console_cmd_t cmd = {
        .command = "uptime",
        .help = "Display system uptime",
        .hint = NULL,
        .func = &uptime_func,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
}

/** 'time' command prints current RTC time */
static int time_func(int argc, char **argv)
{
    if (argc > 1) {
        printf("Usage: time\n");
        return 1;
    }
    struct timeval tv;
    if (gettimeofday(&tv, NULL) != 0) {
        printf("Failed to get time\n");
        return 1;
    }
    struct tm timeinfo;
    localtime_r(&tv.tv_sec, &timeinfo);
    char time_str[64];
    strftime(time_str, sizeof(time_str), "%Y-%m-%d %H:%M:%S", &timeinfo);
    int ms = tv.tv_usec / 1000;
    printf("Current time: %s.%03d\n", time_str, ms);
    return 0;
}

static void register_time(void)
{
    const esp_console_cmd_t cmd = {
        .command = "time",
        .help = "Display current RTC time",
        .hint = NULL,
        .func = &time_func,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
}

/** 'tasks' command prints the list of tasks and related information */
#if WITH_TASKS_INFO

static int tasks_info(int argc, char **argv)
{
    const size_t bytes_per_task = 40; /* see vTaskList description */
    char *task_list_buffer = malloc(uxTaskGetNumberOfTasks() * bytes_per_task);
    if (task_list_buffer == NULL)
    {
        ESP_LOGE(TAG, "failed to allocate buffer for vTaskList output");
        return 1;
    }
    fputs("Task Name\tStatus\tPrio\tHWM\tTask#", stdout);
#ifdef CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID
    fputs("\tAffinity", stdout);
#endif
    fputs("\n", stdout);
    vTaskList(task_list_buffer);
    fputs(task_list_buffer, stdout);
    free(task_list_buffer);
    return 0;
}

static void register_tasks(void)
{
    const esp_console_cmd_t cmd = {
        .command = "tasks",
        .help = "Get information about running tasks",
        .hint = NULL,
        .func = &tasks_info,
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
}

#endif // WITH_TASKS_INFO

/** 'deep_sleep' command puts the chip into deep sleep mode */

static struct
{
    struct arg_int *wakeup_time;
    struct arg_int *wakeup_gpio_num;
    struct arg_int *wakeup_gpio_level;
    struct arg_end *end;
} deep_sleep_args;

static int deep_sleep(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **)&deep_sleep_args);
    if (nerrors != 0)
    {
        arg_print_errors(stderr, deep_sleep_args.end, argv[0]);
        return 1;
    }
    if (deep_sleep_args.wakeup_time->count)
    {
        uint64_t timeout = 1000ULL * deep_sleep_args.wakeup_time->ival[0];
        ESP_LOGI(TAG, "Enabling timer wakeup, timeout=%lluus", timeout);
        ESP_ERROR_CHECK(esp_sleep_enable_timer_wakeup(timeout));
    }
    if (deep_sleep_args.wakeup_gpio_num->count)
    {
        int io_num = deep_sleep_args.wakeup_gpio_num->ival[0];
        if (!GPIO_IS_VALID_GPIO(io_num))
        {
            ESP_LOGE(TAG, "GPIO %d is not a valid IO", io_num);
            return 1;
        }
        int level = 1;
        if (deep_sleep_args.wakeup_gpio_level->count)
        {
            level = deep_sleep_args.wakeup_gpio_level->ival[0];
            if (level != 0 && level != 1)
            {
                ESP_LOGE(TAG, "Invalid wakeup level: %d", level);
                return 1;
            }
        }
        ESP_LOGI(TAG, "Enabling wakeup on GPIO%d, wakeup on %s level",
                 io_num, level ? "HIGH" : "LOW");

#if defined(SOC_PM_SUPPORT_EXT1_WAKEUP)
        ESP_ERROR_CHECK(esp_sleep_enable_ext1_wakeup(1ULL << io_num, level));
#endif
#if defined(SOC_GPIO_SUPPORT_DEEPSLEEP_WAKEUP)
        ESP_ERROR_CHECK(esp_deep_sleep_enable_gpio_wakeup(1ULL << io_num, level));
#endif
    }

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2)
    rtc_gpio_isolate(GPIO_NUM_12);
#endif
    esp_deep_sleep_start();
}
static void register_deep_sleep(void)
{
    deep_sleep_args.wakeup_time =
        arg_int0("t", "time", "<t>", "Wake up time, ms");
    deep_sleep_args.wakeup_gpio_num =
        arg_int0(NULL, "io", "<n>",
                 "If specified, wakeup using GPIO with given number");
    deep_sleep_args.wakeup_gpio_level =
        arg_int0(NULL, "io_level", "<0|1>", "GPIO level to trigger wakeup");
    deep_sleep_args.end = arg_end(3);

    const esp_console_cmd_t cmd = {
        .command = "deep_sleep",
        .help = "Enter deep sleep mode. "
                "Two wakeup modes are supported: timer and GPIO. "
                "If no wakeup option is specified, will sleep indefinitely.",
        .hint = NULL,
        .func = &deep_sleep,
        .argtable = &deep_sleep_args};
    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
}

/** 'light_sleep' command puts the chip into light sleep mode */

static struct
{
    struct arg_int *wakeup_time;
    struct arg_int *wakeup_gpio_num;
    struct arg_int *wakeup_gpio_level;
    struct arg_end *end;
} light_sleep_args;

static int light_sleep(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **)&light_sleep_args);
    if (nerrors != 0)
    {
        arg_print_errors(stderr, light_sleep_args.end, argv[0]);
        return 1;
    }
    esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_ALL);
    if (light_sleep_args.wakeup_time->count)
    {
        uint64_t timeout = 1000ULL * light_sleep_args.wakeup_time->ival[0];
        ESP_LOGI(TAG, "Enabling timer wakeup, timeout=%lluus", timeout);
        ESP_ERROR_CHECK(esp_sleep_enable_timer_wakeup(timeout));
    }
    int io_count = light_sleep_args.wakeup_gpio_num->count;
    if (io_count != light_sleep_args.wakeup_gpio_level->count)
    {
        ESP_LOGE(TAG, "Should have same number of 'io' and 'io_level' arguments");
        return 1;
    }
    for (int i = 0; i < io_count; ++i)
    {
        int io_num = light_sleep_args.wakeup_gpio_num->ival[i];
        int level = light_sleep_args.wakeup_gpio_level->ival[i];
        if (level != 0 && level != 1)
        {
            ESP_LOGE(TAG, "Invalid wakeup level: %d", level);
            return 1;
        }
        ESP_LOGI(TAG, "Enabling wakeup on GPIO%d, wakeup on %s level",
                 io_num, level ? "HIGH" : "LOW");

        ESP_ERROR_CHECK(gpio_wakeup_enable(io_num, level ? GPIO_INTR_HIGH_LEVEL : GPIO_INTR_LOW_LEVEL));
    }
    if (io_count > 0)
    {
        ESP_ERROR_CHECK(esp_sleep_enable_gpio_wakeup());
    }
    if (CONFIG_ESP_CONSOLE_UART_NUM <= UART_NUM_1)
    {
        ESP_LOGI(TAG, "Enabling UART wakeup (press ENTER to exit light sleep)");
        ESP_ERROR_CHECK(uart_set_wakeup_threshold(CONFIG_ESP_CONSOLE_UART_NUM, 3));
        ESP_ERROR_CHECK(esp_sleep_enable_uart_wakeup(CONFIG_ESP_CONSOLE_UART_NUM));
    }
    fflush(stdout);
    uart_wait_tx_idle_polling(CONFIG_ESP_CONSOLE_UART_NUM);
    esp_light_sleep_start();
    esp_sleep_wakeup_cause_t cause = esp_sleep_get_wakeup_cause();
    const char *cause_str;
    switch (cause)
    {
    case ESP_SLEEP_WAKEUP_GPIO:
        cause_str = "GPIO";
        break;
    case ESP_SLEEP_WAKEUP_UART:
        cause_str = "UART";
        break;
    case ESP_SLEEP_WAKEUP_TIMER:
        cause_str = "timer";
        break;
    default:
        cause_str = "unknown";
        printf("%d\n", cause);
    }
    ESP_LOGI(TAG, "Woke up from: %s", cause_str);
    return 0;
}

static void register_light_sleep(void)
{
    light_sleep_args.wakeup_time =
        arg_int0("t", "time", "<t>", "Wake up time, ms");
    light_sleep_args.wakeup_gpio_num =
        arg_intn(NULL, "io", "<n>", 0, 8,
                 "If specified, wakeup using GPIO with given number");
    light_sleep_args.wakeup_gpio_level =
        arg_intn(NULL, "io_level", "<0|1>", 0, 8, "GPIO level to trigger wakeup");
    light_sleep_args.end = arg_end(3);

    const esp_console_cmd_t cmd = {
        .command = "light_sleep",
        .help = "Enter light sleep mode. "
                "Two wakeup modes are supported: timer and GPIO. "
                "Multiple GPIO pins can be specified using pairs of "
                "'io' and 'io_level' arguments. "
                "Will also wake up on UART input.",
        .hint = NULL,
        .func = &light_sleep,
        .argtable = &light_sleep_args};
    ESP_ERROR_CHECK(esp_console_cmd_register(&cmd));
}
void determineChipType(char chip_type[30])
{
    esp_chip_info_t chip_info;
    esp_chip_info(&chip_info);

    switch (chip_info.model)
    {
    case CHIP_ESP32:
        sprintf(chip_type, "%s", "ESP32");
        break;
    case CHIP_ESP32S2:
        sprintf(chip_type, "%s", "ESP32-S2");
        break;
    case CHIP_ESP32S3:
        sprintf(chip_type, "%s", "ESP32-S3");
        break;
    case CHIP_ESP32C3:
        sprintf(chip_type, "%s", "ESP32-C3");
        break;
    case CHIP_ESP32C6:
        sprintf(chip_type, "%s", "ESP32-C6");
        break;
    default:
        int chip_model = chip_info.model;
        sprintf(chip_type, "%s (%d)", "Unknown/Unsupported", chip_model);
        break;
    }
}
